/***************************************************************************************************
* FILE: menu_framework.c

* DESCRIPTION:  --

***************************************************************************************************/

/***************************************************************************************************
* INCLUDE FILES
***************************************************************************************************/
#include "menu_framework.h"
#include "system.h"
/***************************************************************************************************
* LOCAL DEFINES
***************************************************************************************************/


/***************************************************************************************************
* LOCAL GLOBAL VARIABLES
***************************************************************************************************/
MENU *Menu = NULL;

/***************************************************************************************************
* FUNCTION DECLARATION
***************************************************************************************************/


/***************************************************************************************************
* Description:  构造函数
***************************************************************************************************/
MenuList::MenuList(const uint8_t (&str)[37])
{
    u8ItemCount = 0;
    u8CursorPos = 0;
    memcpy(ListName, str, sizeof(str));
    ListItem.clear();
    it = NULL;
}

/***************************************************************************************************
* Description:  析构函数
***************************************************************************************************/
MenuList::~MenuList()
{
    ListItem.clear();
}

/***************************************************************************************************
* Description:  添加一个菜单项
***************************************************************************************************/
void MenuList::AddItem(MENU_LIST_ITEM_ST &list_item)
{
    list<MENU_LIST_ITEM_ST>::iterator i;
    
    ListItem.push_back(list_item);      //插入
    i = ListItem.end();                 //链表尾
    if((--i)->func)
        i->func(MENU_REFRESH, *i);
    u8ItemCount++;
}

/***************************************************************************************************
* Description:  显示光标
***************************************************************************************************/
void MenuList::ShowCursor(void)
{
    FPGA_OsdShowString(0, it->text, 36);
    FPGA_OsdShowAscii(1, "&");
    FPGA_OsdRefreshLine(u8CursorPos+2);
}

/***************************************************************************************************
* Description:  显示一行
***************************************************************************************************/
void MenuList::ShowRow(void)
{
    FPGA_OsdShowString(0, it->text, 36);
    FPGA_OsdShowAscii(1, "&");
    FPGA_OsdRefreshLine(u8CursorPos+2);
}

/***************************************************************************************************
* Description:  返回当前行Text Buffer地址
***************************************************************************************************/
uint8_t *MenuList::GetCurrentRowTextBuffer(void)
{
    return it->text;
}

/***************************************************************************************************
* Description:  在当前行显示字符串
***************************************************************************************************/
void MenuList::ShowStringAtCurrentRow(const uint8_t *str)
{
    FPGA_OsdShowLine(u8CursorPos+2, str);
}

/***************************************************************************************************
* Description:  显示一页
***************************************************************************************************/
void MenuList::Show(void)
{
    uint8_t pos;
    list<MENU_LIST_ITEM_ST>::iterator i;
    
    FPGA_OsdShowLine(0, ListName);
    
    pos = u8CursorPos + 2;
    i = it;
    
    FPGA_OsdShowString(0, i->text, 36);
    FPGA_OsdShowAscii(1, "&");
    FPGA_OsdRefreshLine(pos);
    i--;
    pos--;
    
    for(; pos >= 2; pos--) {
        i->func(MENU_REFRESH, *i);
        FPGA_OsdShowLine(pos, i->text);
        i--;
    }
    
    pos = u8CursorPos+3;
    
    i = it;
    i++;
    if(i != ListItem.end()) {
        do {
            if(pos <= 9)
            {
                i->func(MENU_REFRESH, *i);
                FPGA_OsdShowLine(pos, i->text);
                pos++;
            }
            else
            {
                break;
            }
        }while(++i != ListItem.end());
    }
    
    while(pos <= 9) {
        FPGA_OsdShowLine(pos, "                                    ");
        pos++;
    }
    
    //    ShowCursor();
}

/***************************************************************************************************
* Description:  光标向上移动
***************************************************************************************************/
void MenuList::Up(void)
{
    if(it->func)
        it->func(MENU_UP, *it);
    
    if(it-- != ListItem.begin())
    {
        if(u8CursorPos > 0) u8CursorPos--;
        else u8CursorPos = 0;
    }
    else
    {
        it = ListItem.end();
        it--;
        if(u8ItemCount < 8) u8CursorPos = u8ItemCount-1;
        else u8CursorPos = 7;
    }
    
    if(it->func)
        it->func(MENU_SELECT, *it);
    
    Show();
}

/***************************************************************************************************
* Description:  光标向下移动
***************************************************************************************************/
void MenuList::Down(void)
{
    if(it->func)
        it->func(MENU_DOWN, *it);
    
    if(++it != ListItem.end())
    {
        if(u8CursorPos < 7) u8CursorPos++;
        else u8CursorPos = 7;
    }
    else
    {
        it = ListItem.begin();
        u8CursorPos = 0;
    }
    
    if(it->func)
        it->func(MENU_SELECT, *it);
    
    Show();
}

/***************************************************************************************************
* Description:  调用项目确定函数
***************************************************************************************************/
void MenuList::Enter(void)
{
    if(it->func)
        it->func(MENU_ENTER, *it);
}

/***************************************************************************************************
* Description:  调用项目左函数
***************************************************************************************************/
void MenuList::Left(void)
{
    if(it->func)
        it->func(MENU_LEFT, *it);
}

/***************************************************************************************************
* Description:  调用项目右函数
***************************************************************************************************/
void MenuList::Right(void)
{
    if(it->func)
        it->func(MENU_RIGHT, *it);
}

/***************************************************************************************************
* Description:  MENU构造函数
***************************************************************************************************/
MENU::MENU(LANGUAGE_E lang)
{
    eLanguage = lang;
    ShowFrame();
    MenuStackList.clear();
}

/***************************************************************************************************
* Description:  MENU析构函数
***************************************************************************************************/
MENU::~MENU()
{
    delete pMenuList;
}

/***************************************************************************************************
* Description:  返回当前语言ID
***************************************************************************************************/
uint8_t MENU:: getLanguageIndex(void)
{
    return (uint8_t)eLanguage;
}

/***************************************************************************************************
* Description:  MENU显示框架
***************************************************************************************************/
const uint8_t Menu_Frame[][37] = 
{
    "------------------------------------",
    "   #$ Roll           %& Change      ",
    "   [HOME] Enter      [CLOSE] Back   ",
    "   #$ 滚动           %& 调整        ",
    "   [中心点] 确定     [退出] 返回   ",
    "   #$ 滾動           %& 調整        ",
    "   [中心点] 確定     [退出] 返回   ",
};
void MENU::ShowFrame(void)
{
    FPGA_OsdShowLine(1, Menu_Frame[0]);
    FPGA_OsdShowLine(10, Menu_Frame[0]);
    FPGA_OsdShowLine(11, Menu_Frame[eLanguage*2+1]);
    FPGA_OsdShowLine(12, Menu_Frame[eLanguage*2+2]);
}

/***************************************************************************************************
* Description:  创建一个列表
***************************************************************************************************/
void MENU::CreateList(const LIST_ITEM_ST &listname)
{
    MenuStackList.push_front(pMenuList);
    pMenuList = new MenuList(listname.text[eLanguage]);
}

/***************************************************************************************************
* Description:  增加一个项目
***************************************************************************************************/
void MENU::ListApendItem(const LIST_ITEM_ST &listitem)
{
    MENU_LIST_ITEM_ST stTemp;
    stTemp.func = listitem.func;
    memcpy(stTemp.text, listitem.text[eLanguage], 37);
    pMenuList->AddItem(stTemp);
    
    pMenuList->it = pMenuList->ListItem.begin();
}


void MENU::ShowStringAtCurrentRow(const uint8_t *str)
{
    pMenuList->ShowStringAtCurrentRow(str);
}

/***************************************************************************************************
* Description:  刷新当前行
***************************************************************************************************/
void MENU::ShowRow(void)
{
    pMenuList->ShowRow();
}

/***************************************************************************************************
* Description:  显示当前列表
***************************************************************************************************/
void MENU::Show(void)
{
    pMenuList->Show();
}

/***************************************************************************************************
* Description:  光标向上移动一行
***************************************************************************************************/
void MENU::Up(void)
{
    pMenuList->Up();
}

/***************************************************************************************************
* Description:  光标向下移动一行
***************************************************************************************************/
void MENU::Down(void)
{
    pMenuList->Down();
}

/***************************************************************************************************
* Description:  列表左功能
***************************************************************************************************/
void MENU::Left(void)
{
    Menu->pMenuList->Left();
    Menu->pMenuList->ShowRow();
}

/***************************************************************************************************
* Description:  列表右功能
***************************************************************************************************/
void MENU::Right(void)
{
    pMenuList->Right();
    pMenuList->ShowRow();
}

/***************************************************************************************************
* Description:  列表确认功能
***************************************************************************************************/
void MENU::Enter(void)
{
    pMenuList->Enter();
}

/***************************************************************************************************
* Description:  执行对应项目函数
***************************************************************************************************/
void MENU::RunFunc(uint8_t todo)
{
    if(pMenuList->it->func)
        pMenuList->it->func(todo, *(pMenuList->it));
}

/***************************************************************************************************
* Description:  返回上一层菜单，是顶层则关闭菜单
***************************************************************************************************/
bool MENU::Back(void)
{
    if(MenuStackList.size() > 1)
    {
        if(pMenuList->it->func)
            pMenuList->it->func(MENU_BACK, *(pMenuList->it));
        
        MenuList *temp = pMenuList;
        pMenuList = *(MenuStackList.begin());
        pMenuList->Show();
        MenuStackList.pop_front();
        delete temp;
        return false;
    }
    else
    {
        return true;
    }
}
bool MENU::BackNoRefresh(void)
{
    if(MenuStackList.size() > 1)
    {
        MenuList *temp = pMenuList;
        pMenuList = *(MenuStackList.begin());
        MenuStackList.pop_front();
        delete temp;
        return false;
    }
    else
    {
        return true;
    }
}



/****************************************** END OF FILE *******************************************/
